KD9QZO/ATU100-EXT-FW-PIC16F1938/src/main.c
/**
 * \file main.c
 * \brief ATU-100 EXT firmware for PIC16F1938 main program
 *
 * \version		3.2.1
 * \author		Gerad Munsch <gmunsch@kd9qzo.com>
 * \date			December 2021
 * \author		David Fainitski
 * \date			2016
 */

#include <xc.h>

#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <stdlib.h>

#include "extratypes.h"
#include "preprocessor.h"

#include "oled_control.h"
#include "pic_init.h"
#include "main.h"



/* ================================================================================================================== *
 *   VARIABLES                                                                                                        *
 * ================================================================================================================= */

int SWR_fixed_old = 0;
int work_int;
unsigned char work_char;
unsigned char work_str[7];
unsigned char work_str_2[7];

float Forward;

int Power = 0;
int Power_old = 10000;
int SWR_old = 10000;

char type;
char Soft_tune = 0;
char Auto = 0;
char Track = 0;
char bypas = 0;
char cap_mem = 0;
char ind_mem = 0;
char SW_mem = 0;
char Auto_mem = 0;

int Auto_delta;

char Restart = 0;
char Test = 0;
char lcd_prep_short = 0;
char L = 1;
char but = 0;

int Cap1;
int Cap2;
int Cap3;
int Cap4;
int Cap5;
int Cap6;
int Cap7;

int Ind1;
int Ind2;
int Ind3;
int Ind4;
int Ind5;
int Ind6;
int Ind7;

char Dysp_delay = 0;
int dysp_cnt = 0;
float dysp_cnt_mult = 2.3;

char Loss_mode = 0;
char Fid_loss;

char dysp = 1;

bool tune_btn_release;



#if 0
void interrupt() {
}
#endif


void main() {
	if (STATUS.B4 == 0) {
		Restart = 1;
	}

	pic_init();

	Delay_ms(300);
	asm("CLRWDT");
	cells_init();
	Soft_I2C_Init();
	if (type == 0) { // 2-colors led  reset
		LATBbits.LATB6 = 1;
		LATBbits.LATB7 = 1;
	}
	dysp_cnt = Dysp_delay * dysp_cnt_mult;

	Delay_ms(300);
	asm("CLRWDT");

	if ((PORTBbits.RB1 == 0) && (PORTBbits.RB2 == 0)) { // Test mode
		Test = 1;
		Auto = 0;
	}

	if (L_q == 5)L_mult = 1;
	else if (L_q == 6) L_mult = 2;
	else if (L_q == 7) L_mult = 4;

	if (C_q == 5) C_mult = 1;
	else if (C_q == 6) C_mult = 2;
	else if (C_q == 7) C_mult = 4;

	Delay_ms(300);
	asm("CLRWDT");
	Delay_ms(300);
	asm("CLRWDT");
	Delay_ms(300);
	asm("CLRWDT");
	Delay_ms(300);
	asm("CLRWDT");
	Delay_ms(300);
	asm("CLRWDT");

	led_init();

	if (PORTBbits.RB1 == 0 && PORTBbits.RB2 == 0 && PORTBbits.RB0 == 0) { // Fast Test mode (loop)
		if (type == 4 | type == 5) led_wr_str(0, 12, "FAST TEST", 9); // 128*64
		else if (type != 0) led_wr_str(0, 3, "FAST TEST", 9); // 1602 | 128*32
		set_cap(255);
		if (L_invert == 0) set_ind(255);
		else set_ind(0);
		set_sw(1);
		asm("CLRWDT");
		while (1) {
			Delay_ms(500);
			asm("CLRWDT");
		}
	}
	asm("CLRWDT");

	if (Button(&PORTB, 0, 100, 0)) { //  Fider loss input
		if (type == 4 | type == 5) {
			led_wr_str(0, 6, "Fider Loss", 10); // 128*64
			led_wr_str(2, 6, "input", 5);
			led_wr_str(4, 6 + 3 * 12, "dB", 2);
		} else if (type != 0) {
			led_wr_str(0, 0, "Fider Loss input", 16); // 1602 | 128*32
			led_wr_str(1, 3, "dB", 2);
		}
		Fid_loss = Bcd2Dec(EEPROM_Read(0x34));
		show_loss();

		while (1) {
			if (Button(&PORTB, 2, 50, 0)) { // BYP button
				if (Fid_loss < 99) {
					Fid_loss++;
					show_loss();
					EEPROM_Write(0x34, Dec2Bcd(Fid_loss));
				}
				while (Button(&PORTB, 2, 50, 0)) asm("CLRWDT");
			}

			if (Button(&PORTB, 1, 50, 0)) { // AUTO button
				if (Fid_loss > 0) {
					Fid_loss--;
					show_loss();
					EEPROM_Write(0x34, Dec2Bcd(Fid_loss));
				}
				while (Button(&PORTB, 1, 50, 0)) asm("CLRWDT");
			}
			asm("CLRWDT");
		} // while
	} //  Fider loss input
	//
	if (Test == 0) {
		cap = EEPROM_Read(255);
		ind = EEPROM_Read(254);
		SW = EEPROM_Read(253);
		swr_a = EEPROM_Read(252) * 256;
		swr_a += EEPROM_Read(251);
		set_ind(ind);
		set_cap(cap);
		set_sw(SW);
		if (Restart == 1) lcd_prep_short = 1;
		lcd_prep();
	} else Test_init();

	lcd_ind();
	tune_btn_release = 1;



	//*******************************

	while (1) {
		asm("CLRWDT");
		lcd_pwr();

		if (Test == 0) button_proc();
		else button_proc_test();

		if (dysp_cnt != 0) dysp_cnt--;
		else if (Test == 0 && Dysp_delay != 0 && dysp == 1) {
			if (Relay_off) {
				set_ind(0);
				set_cap(0);
				set_SW(0);
			}
			dysp = 0;
			dysp_off();
		}

		// next While code
	}
}


//***************** Routines *****************

void button_proc_test(void) {
	if (Button(&PORTB, 0, 50, 0)) { // Tune btn
		Delay_ms(250);
		asm("CLRWDT");
		if (PORTBbits.RB0 == 1) { // short press button
			if (SW == 0) SW = 1;
			else SW = 0;
			set_sw(SW);
			lcd_ind();
		} else { // long press button
			if (L == 1) L = 0;
			else L = 1;
			if (L == 1) {
				if (type == 4 || type == 5) // 128*64 OLED
					led_wr_str(0, 16 + 12 * 8, "l", 1);
				else if (type != 0) // 1602 LCD & 128*32 OLED
					led_wr_str(0, 8, "l", 1);
			} else {
				if (type == 4 || type == 5) // 128*64 OLED
					led_wr_str(0, 16 + 12 * 8, "c", 1);
				else if (type != 0) // 1602 LCD & 128*32 OLED
					led_wr_str(0, 8, "c", 1);
			}
		}
		while (Button(&PORTB, 0, 50, 0)) {
			lcd_pwr();
			asm("CLRWDT");
		}
	} // END Tune btn
	//
	if (Button(&PORTB, 2, 50, 0)) { // BYP button
		asm("CLRWDT");
		while (PORTBbits.RB2 == 0) {
			if (L & ind < 32 * L_mult - 1) {
				ind++;
				set_ind(ind);
			} else if (!L & cap < 32 * L_mult - 1) {
				cap++;
				set_cap(cap);
			}
			lcd_ind();
			lcd_pwr();
			Delay_ms(30);
			asm("CLRWDT");
		}
	} // end of BYP button
	//
	if (Button(&PORTB, 1, 50, 0) & bypas == 0) { // Auto button
		asm("CLRWDT");
		while (PORTBbits.RB1 == 0) {
			if (L & ind > 0) {
				ind--;
				set_ind(ind);
			} else if (!L & cap > 0) {
				cap--;
				set_cap(cap);
			}
			lcd_ind();
			lcd_pwr();
			Delay_ms(30);
			asm("CLRWDT");
		}
	}
	return;
}

void button_proc(void) {
	if (tune_btn_release == 0 && Button(&PORTB, 0, 50, 1)) tune_btn_release = 1;
	if (tune_btn_release == 0 && Button(&PORTB, 0, 50, 0)) dysp_cnt = Dysp_delay * dysp_cnt_mult;
	if ((Button(&PORTB, 0, 50, 0) && tune_btn_release) | Soft_tune) {
		if (dysp == 0) { // dysplay ON
			if (Relay_off == 1) {
				set_ind(ind);
				set_cap(cap);
				set_SW(SW);
			}
			dysp = 1;
			dysp_on();
			dysp_cnt = Dysp_delay * dysp_cnt_mult;
			return;
		}
		dysp_cnt = Dysp_delay * dysp_cnt_mult;
		Delay_ms(250);
		asm("CLRWDT");
		if (Soft_tune == 0 & PORTBbits.RB0 == 1) { // short press button
			show_reset();
			bypas = 0;
		} else { // long press button
			p_Tx = 1; //
			n_Tx = 0; // TX request
			Delay_ms(250); //
			btn_push();
			bypas = 0;
			Soft_tune = 0;
			tune_btn_release = 0;
		}
	}
	//
	if (Button(&PORTB, 2, 50, 0)) { // BYP button
		if (dysp == 0) { // dysplay ON
			if (Relay_off == 1) {
				set_ind(ind);
				set_cap(cap);
				set_SW(SW);
			}
			dysp = 1;
			dysp_on();
			dysp_cnt = Dysp_delay * dysp_cnt_mult;
			return;
		}
		dysp_cnt = Dysp_delay * dysp_cnt_mult;
		asm("CLRWDT");
		if (bypas == 0) {
			bypas = 1;
			cap_mem = cap;
			ind_mem = ind;
			SW_mem = SW;
			cap = 0;
			if (L_invert) ind = 255;
			else ind = 0;
			SW = 1;
			set_ind(ind);
			set_cap(cap);
			set_SW(SW);
			if (Loss_mode == 0) lcd_ind();
			Auto_mem = Auto;
			Auto = 0;
		} else {
			bypas = 0;
			cap = cap_mem;
			ind = ind_mem;
			SW = SW_mem;
			set_cap(cap);
			set_ind(ind);
			set_SW(SW);
			if (Loss_mode == 0) lcd_ind();
			Auto = Auto_mem;
		}
		if (type == 4 || type == 5) { // 128*64 OLED
			if (Auto && !bypas) led_wr_str(0, 16 + 8 * 12, ".", 1);
			else if (!Auto && bypas) led_wr_str(0, 16 + 8 * 12, "_", 1);
			else led_wr_str(0, 16 + 8 * 12, " ", 1);
		} else if (type != 0) { //  1602 LCD  or 128*32 OLED
			if (Auto && !bypas) led_wr_str(0, 8, ".", 1);
			else if (!Auto && bypas) led_wr_str(0, 8, "_", 1);
			else led_wr_str(0, 8, " ", 1);
		}
		asm("CLRWDT");
		while (Button(&PORTB, 2, 50, 0)) {
			lcd_pwr();
			asm("CLRWDT");
		}
	}
	//
	if (Button(&PORTB, 1, 50, 0) && (bypas == 0)) { // Auto button
		if (dysp == 0) { // dysplay ON
			if (Relay_off == 1) {
				set_ind(ind);
				set_cap(cap);
				set_SW(SW);
			}
			dysp = 1;
			dysp_on();
			dysp_cnt = Dysp_delay * dysp_cnt_mult;
			return;
		}
		dysp_cnt = Dysp_delay * dysp_cnt_mult;
		asm("CLRWDT");
		if (Auto == 0) {
			Auto = 1;
		} else {
			Auto = 0;
		}

		EEPROM_Write(2, Auto);

