KD9QZO/ATU100-EXT-FW-PIC16F1938/src/main.c
		if ((type == 4) || (type == 5)) { // 128*64 OLED
			if (Auto & !bypas) led_wr_str(0, 16 + 8 * 12, ".", 1);
			else if (!Auto & bypas) led_wr_str(0, 16 + 8 * 12, "_", 1);
			else led_wr_str(0, 16 + 8 * 12, " ", 1);
		} else if (type != 0) { //  1602 LCD  or 128*32 OLED
			if (Auto & !bypas) led_wr_str(0, 8, ".", 1);
			else if (!Auto & bypas) led_wr_str(0, 8, "_", 1);
			else led_wr_str(0, 8, " ", 1);
		}
		asm("CLRWDT");
		while (Button(&PORTB, 1, 50, 0)) {
			lcd_pwr();
			asm("CLRWDT");
		}
	}
	return;
}

void show_reset() {
	atu_reset();
	SW = 1;
	set_sw(SW);
	EEPROM_Write(255, 0);
	EEPROM_Write(254, 0);
	EEPROM_Write(253, 1);
	EEPROM_Write(252, 0);
	EEPROM_Write(251, 0);
	lcd_ind();
	Loss_mode = 0;
	p_Tx = 0;
	n_Tx = 1;
	SWR = 0;
	PWR = 0;
	SWR_fixed_old = 0;
	if (type == 4 | type == 5) { // 128*64 OLED
		led_wr_str(2, 16, "RESET   ", 8);
		asm("CLRWDT");
		delay_ms(600);
		led_wr_str(2, 16, "SWR=0.00", 8);
		asm("CLRWDT");
	} else if (type != 0) {// 1602 LCD & 128*32 OLED
		led_wr_str(1, 0, "RESET   ", 8);
		asm("CLRWDT");
		delay_ms(600);
		led_wr_str(1, 0, "SWR=0.00", 8);
		asm("CLRWDT");
	} else {
		LATBbits.LATB6 = 1;
		LATBbits.LATB7 = 1;
	}
	SWR_old = 10000;
	Power_old = 10000;
	lcd_pwr();
	return;
}

void btn_push() {
	asm("CLRWDT");
	if (type == 4 | type == 5) { // 128*64 OLED
		led_wr_str(2, 16 + 12 * 4, "TUNE", 4);
	} else if (type != 0) { // 1602 LCD & 128*32 OLED
		led_wr_str(1, 4, "TUNE", 4);
	} else {
		LATBbits.LATB6 = 1;
		LATBbits.LATB7 = 1;
	}
	tune();
	if (type == 0) { // real-time 2-colors led work
		if (swr <= 150) {
			LATBbits.LATB6 = 0;
			LATBbits.LATB7 = 1;
		}// Green
		else if (swr <= 250) {
			PORTBbits.RB6 = 0;
			PORTBbits.RB7 = 0;
		}// Orange
		else {
			PORTBbits.RB6 = 1;
			PORTBbits.RB7 = 0;
		} // Red
	} else if (Loss_mode == 0 | Loss_ind == 0) lcd_ind();
	EEPROM_Write(255, cap);
	EEPROM_Write(254, ind);
	EEPROM_Write(253, SW);
	EEPROM_Write(252, swr_a / 256);
	EEPROM_Write(251, swr_a % 256);
	SWR_old = 10000;
	Power_old = 10000;
	lcd_pwr();
	SWR_fixed_old = SWR;
	p_Tx = 0;
	n_Tx = 1;
	asm("CLRWDT");
	return;
}

void lcd_prep() {
	asm("CLRWDT");
	if (type == 4 | type == 5) { // 128*64 OLED
		if (lcd_prep_short == 0) {
			led_wr_str(0, 22, "ATU-100", 7);
			led_wr_str(2, 6, "EXT board", 9);
			led_wr_str(4, 16, "by N7DDC", 8);
			led_wr_str(6, 4, "FW ver 3.2", 10);
			asm("CLRWDT");
			Delay_ms(600);
			asm("CLRWDT");
			Delay_ms(500);
			asm("CLRWDT");
			led_wr_str(0, 16, "        ", 8);
			led_wr_str(2, 4, "          ", 10);
			led_wr_str(4, 16, "        ", 8);
			led_wr_str(6, 4, "          ", 10);
		}
		Delay_ms(150);
		if (P_High == 1) led_wr_str(0, 16, "PWR=  0W", 8);
		else led_wr_str(0, 16, "PWR=0.0W", 8);
		led_wr_str(2, 16, "SWR=0.00", 8);
		if (Auto) led_wr_str(0, 16 + 8 * 12, ".", 1);
	} else if (type != 0) { // 1602 LCD & 128*32 OLED
		if (lcd_prep_short == 0) {
			led_wr_str(0, 4, "ATU-100", 7);
			led_wr_str(1, 3, "EXT board", 9);
			asm("CLRWDT");
			Delay_ms(700);
			asm("CLRWDT");
			Delay_ms(500);
			asm("CLRWDT");
			led_wr_str(0, 4, "by N7DDC", 8);
			led_wr_str(1, 3, "FW ver 3.2", 10);
			asm("CLRWDT");
			Delay_ms(600);
			asm("CLRWDT");
			Delay_ms(500);
			asm("CLRWDT");
			led_wr_str(0, 4, "        ", 8);
			led_wr_str(1, 3, "          ", 10);
		}
		Delay_ms(150);
		if (P_High == 1) led_wr_str(0, 0, "PWR=  0W", 8);
		else led_wr_str(0, 0, "PWR=0.0W", 8);
		led_wr_str(1, 0, "SWR=0.00", 8);
		if (Auto) led_wr_str(0, 8, ".", 1);
	}
	asm("CLRWDT");
	lcd_ind();
	return;
}

void lcd_swr(int swr) {
	asm("CLRWDT");

	if (swr != SWR_old) {
		SWR_old = swr;
		if (SWR == 0) { // Low power
			if ((type == 4) || (type == 5)) {				/* 128x64 OLED */
				led_wr_str(2, 16 + 4 * 12, "0.00", 4);
			} else if (type != 0) {							/* 1602 & 128x32 OLED */
				led_wr_str(1, 4, "0.00", 4);
			} else if (type == 0) {							/* real-time 2-colors led work */
				LATBbits.LATB6 = 1;
				LATBbits.LATB7 = 1;
			}
			SWR_old = 0;
		} else {
			IntToStr(swr, work_str);
			work_str_2[0] = work_str[3];
			work_str_2[1] = '.';
			work_str_2[2] = work_str[4];
			work_str_2[3] = work_str[5];

			if ((type == 4) || (type == 5)) {
				led_wr_str(2, 16 + 4 * 12, work_str_2, 4);
			} else if (type != 0) {
				led_wr_str(1, 4, work_str_2, 4);
			} else if (type == 0) {
				if (swr <= 150) {							/* Green */
					LATBbits.LATB6 = 0;
					LATBbits.LATB7 = 1;
				} else if (swr <= 250) {					/* Orange */
					PORTBbits.RB6 = 0;
					PORTBbits.RB7 = 0;
				} else {									/* Red */
					PORTBbits.RB6 = 1;
					PORTBbits.RB7 = 0;
				}
			}
		}
	}

	asm("CLRWDT");

	return;
}

void button_delay() {
	if ((Button(&PORTB, 0, 25, 0)) | (Button(&PORTB, 1, 25, 0)) | (Button(&PORTB, 2, 25, 0))) {
		but = 1;
	}
	return;
}

void show_pwr(int Power, int SWR) {
	int p_ant, eff;
	float a, b;
	a = 100;
	asm("CLRWDT");
	//
	if (Test == 0 & Loss_ind == 1 & Power >= 10) {
		if (Loss_mode == 0) { // prepare
			if (type == 4 | type == 5) { // 128*64 OLED
				if (P_High == 1) led_wr_str(4, 16, "ANT=  0W", 8);
				else led_wr_str(4, 16, "ANT=0.0W", 8);
				led_wr_str(6, 16, "EFF=  0%", 8);
			} else if (type == 2 | type == 3) { // 128*32 OLED
				if (P_High == 1) led_wr_str(0, 9, "ANT=  0W", 8);
				else led_wr_str(0, 9, "ANT=0.0W", 8);
				led_wr_str(1, 9, "EFF=  0%", 8);
			} else if (type == 1) { // 1602 LCD
				if (P_High == 1) led_wr_str(0, 9, "AN=  0W", 7);
				else led_wr_str(0, 9, "AN=0.0W", 7);
				led_wr_str(1, 9, "EFF= 0%", 7);
			}
		}
		Loss_mode = 1;
	} else {
		if (Loss_mode == 1) lcd_ind();
		Loss_mode = 0;
	}
	asm("CLRWDT");
	if (Power != Power_old) {
		Power_old = Power;
		//
		if (P_High == 0) {
			if (Power >= 100) { // > 10 W
				Power += 5; // rounding to 1 W
				IntToStr(Power, work_str);
				work_str_2[0] = work_str[2];
				work_str_2[1] = work_str[3];
				work_str_2[2] = work_str[4];
				work_str_2[3] = 'W';
			} else {
				IntToStr(Power, work_str);
				if (work_str[4] != ' ') work_str_2[0] = work_str[4];
				else work_str_2[0] = '0';
				work_str_2[1] = '.';
				if (work_str[5] != ' ') work_str_2[2] = work_str[5];
				else work_str_2[2] = '0';
				work_str_2[3] = 'W';
			}
		} else { // High Power
			if (Power < 999) { // 0 - 999 Watt
				IntToStr(Power, work_str);
				work_str_2[0] = work_str[3];
				work_str_2[1] = work_str[4];
				work_str_2[2] = work_str[5];
				work_str_2[3] = 'W';
			} else {
				IntToStr(Power, work_str);
				work_str_2[0] = work_str[2];
				work_str_2[1] = work_str[3];
				work_str_2[2] = work_str[4];
				work_str_2[3] = work_str[5];
			}
		}
		if (type == 4 | type == 5) led_wr_str(0, 16 + 4 * 12, work_str_2, 4); // 128*64 OLED
		else if (type != 0) led_wr_str(0, 4, work_str_2, 4); // 1602  & 128*32
		//
		asm("CLRWDT");
		//  Loss indication
		if (Loss_mode == 1) {
			if (ind == 0 & cap == 0) swr_a = SWR;
			a = 1.0 / ((swr_a / 100.0 + 100.0 / swr_a) * Fid_loss / 10.0 * 0.115 + 1.0); // Fider loss
			b = 4.0 / (2.0 + SWR / 100.0 + 100.0 / SWR); // SWR loss
			if (a >= 1.0) a = 1.0;
			if (b >= 1.0) b = 1.0;
			p_ant = Power * a * b;
			eff = a * b * 100;
			if (eff >= 100) eff = 99;
			//
			if (P_High == 0) {
				if (p_ant >= 100) { // > 10 W
					p_ant += 5; // rounding to 1 W
					IntToStr(p_ant, work_str);
					work_str_2[0] = work_str[2];
					work_str_2[1] = work_str[3];
					work_str_2[2] = work_str[4];
					work_str_2[3] = 'W';
				} else {
					IntToStr(p_ant, work_str);
					if (work_str[4] != ' ') work_str_2[0] = work_str[4];
					else work_str_2[0] = '0';
					work_str_2[1] = '.';
					if (work_str[5] != ' ') work_str_2[2] = work_str[5];
					else work_str_2[2] = '0';
					work_str_2[3] = 'W';
				}
			} else { // High Power
				if (p_ant < 999) { // 0 - 1500 Watts
					IntToStr(p_ant, work_str);
					work_str_2[0] = work_str[3];
					work_str_2[1] = work_str[4];
					work_str_2[2] = work_str[5];
					work_str_2[3] = 'W';
				} else {
					IntToStr(p_ant, work_str);
					work_str_2[0] = work_str[2];
					work_str_2[1] = work_str[3];
					work_str_2[2] = work_str[4];
					work_str_2[3] = work_str[5];
				}
			}
			if (type == 4 | type == 5) led_wr_str(4, 16 + 4 * 12, work_str_2, 4); // 128*64 OLED
			else if (type == 2 | type == 3) led_wr_str(0, 13, work_str_2, 4); // 128*32
			else if (type != 0) led_wr_str(0, 12, work_str_2, 4); // 1602
			//
			IntToStr(eff, work_str);
			work_str_2[0] = work_str[4];
			work_str_2[1] = work_str[5];
			if (type == 4 | type == 5) led_wr_str(6, 16 + 5 * 12, work_str_2, 2);
			else if (type == 2 | type == 3) led_wr_str(1, 14, work_str_2, 2);
			else if (type == 1) led_wr_str(1, 13, work_str_2, 2);
		}
	}
	asm("CLRWDT");
	return;
}

