KD9QZO/ATU100-EXT-FW-PIC16F1938/src/main.c
void lcd_pwr() {
	int p = 0;
	char peak_cnt;
	int delta = Auto_delta - 100;
	char cnt;
	int SWR_fixed;
	PWR = 0;
	asm("CLRWDT");
	//
	if (dysp == 0 & Relay_off == 1) {
		get_pwr();
		if (PWR >= 10) {
			set_ind(ind);
			set_cap(cap);
			set_SW(SW);
			//
			dysp = 1;
			dysp_on(); // dysplay ON
			dysp_cnt = Dysp_delay * dysp_cnt_mult;
		}
		return;
	}

	// peak detector
	cnt = 120;
	for (peak_cnt = 0; peak_cnt < cnt; peak_cnt++) {
		if (PORTBbits.RB1 == 0 | PORTBbits.RB2 == 0 | (PORTBbits.RB0 == 0 & tune_btn_release)) {
			button_delay();
			if (but == 1) {
				but = 0;
				return;
			}
		}
		get_pwr();
		if (PWR > p) {
			p = PWR;
			SWR_fixed = SWR;
		}
		Delay_ms(3);
	}

	asm("CLRWDT");

	if (p >= 100) {
		p = (p + 5) / 10;
		p *= 10;
	} // round to 1 W if more then 100 W

	Power = p;
	if (Power < 10) SWR_fixed = 0;
	lcd_swr(SWR_fixed);
	if (Power >= 10 & Dysp_delay > 0) {
		dysp_cnt = Dysp_delay * dysp_cnt_mult;
	}

	if (Auto & SWR_fixed >= Auto_delta & ((SWR_fixed > SWR_fixed_old & (SWR_fixed - SWR_fixed_old) > delta) | (SWR_fixed < SWR_fixed_old & (SWR_fixed_old - SWR_fixed) > delta) | SWR_fixed_old == 999))
		Soft_tune = 1;

	if ((PORTBbits.RB1 == 0) || (PORTBbits.RB2 == 0) || ((PORTBbits.RB0 == 0) && tune_btn_release)) {
		button_delay();
		if (but == 1) {
			but = 0;
			return;
		}
	} // Fast return if button pressed

	show_pwr(Power, SWR_fixed);

	if (PORTBbits.RB1 == 0 | PORTBbits.RB2 == 0 | (PORTBbits.RB0 == 0 & tune_btn_release)) {
		button_delay();
		if (but == 1) {
			but = 0;
			return;
		}
	}

	asm("CLRWDT");

	if (Overload == 1) {
		if (type == 4 | type == 5) { // 128*64 OLED
			led_wr_str(2, 16, "        ", 8);
			delay_ms(100);
			led_wr_str(2, 16, "OVERLOAD", 8);
			delay_ms(500);
			asm("CLRWDT");
			led_wr_str(2, 16, "        ", 8);
			delay_ms(300);
			asm("CLRWDT");
			led_wr_str(2, 16, "OVERLOAD", 8);
			delay_ms(500);
			asm("CLRWDT");
			led_wr_str(2, 16, "        ", 8);
			delay_ms(300);
			asm("CLRWDT");
			led_wr_str(2, 16, "OVERLOAD", 8);
			delay_ms(500);
			asm("CLRWDT");
			led_wr_str(2, 16, "        ", 8);
			delay_ms(100);
			led_wr_str(2, 16, "SWR=    ", 8);
		} else if (type != 0) { // 1602  & 128*32
			led_wr_str(1, 0, "        ", 8);
			delay_ms(100);
			led_wr_str(1, 0, "OVERLOAD", 8);
			delay_ms(500);
			asm("CLRWDT");
			led_wr_str(1, 0, "        ", 8);
			delay_ms(300);
			asm("CLRWDT");
			led_wr_str(1, 0, "OVERLOAD", 8);
			delay_ms(500);
			asm("CLRWDT");
			led_wr_str(1, 0, "        ", 8);
			delay_ms(300);
			asm("CLRWDT");
			led_wr_str(1, 0, "OVERLOAD", 8);
			delay_ms(500);
			asm("CLRWDT");
			led_wr_str(1, 0, "        ", 8);
			delay_ms(100);
			led_wr_str(1, 0, "SWR=    ", 8);
		}
		asm("CLRWDT");
		SWR_old = 10000;
		lcd_swr(SWR_fixed);
	}
	return;
}

void lcd_ind() {
	char column;

	asm("CLRWDT");

	if (1) {
		work_int = 0;
		if (ind.B0) work_int += Ind1;
		if (ind.B1) work_int += Ind2;
		if (ind.B2) work_int += Ind3;
		if (ind.B3) work_int += Ind4;
		if (ind.B4) work_int += Ind5;
		if (ind.B5) work_int += Ind6;
		if (ind.B6) work_int += Ind7;
		if (work_int > 9999) { // more then 9999 nH
			work_int += 50; // round
			IntToStr(work_int, work_str);
			work_str_2[0] = work_str[1];
			work_str_2[1] = work_str[2];
			work_str_2[2] = '.';
			work_str_2[3] = work_str[3];
		} else {
			IntToStr(work_int, work_str);
			if (work_str[2] != ' ') work_str_2[0] = work_str[2];
			else work_str_2[0] = '0';
			work_str_2[1] = '.';
			if (work_str[3] != ' ') work_str_2[2] = work_str[3];
			else work_str_2[2] = '0';
			if (work_str[4] != ' ') work_str_2[3] = work_str[4];
			else work_str_2[3] = '0';
		}

		if (type == 4 | type == 5) { // 128*64 OLED
			if (SW == 1) column = 4;
			else column = 6;
			led_wr_str(column, 16, "L=", 2);
			led_wr_str(column, 16 + 6 * 12, "uH", 2);
			led_wr_str(column, 16 + 2 * 12, work_str_2, 4);
		} else if (type == 2 | type == 3) {// 128*32 OLED
			if (SW == 1) column = 0;
			else column = 1;
			led_wr_str(column, 9, "L=", 2);
			led_wr_str(column, 15, "uH", 2);
			led_wr_str(column, 11, work_str_2, 4);
		} else if (type == 1) { //  1602 LCD
			if (SW == 1) column = 0;
			else column = 1;
			led_wr_str(column, 9, "L=", 2);
			led_wr_str(column, 15, "u", 1);
			led_wr_str(column, 11, work_str_2, 4);
		}
	}

	asm("CLRWDT");

	if (1) {
		work_int = 0;
		if (cap.B0) work_int += Cap1;
		if (cap.B1) work_int += Cap2;
		if (cap.B2) work_int += Cap3;
		if (cap.B3) work_int += Cap4;
		if (cap.B4) work_int += Cap5;
		if (cap.B5) work_int += Cap6;
		if (cap.B6) work_int += Cap7;
		IntToStr(work_int, work_str);
		work_str_2[0] = work_str[2];
		work_str_2[1] = work_str[3];
		work_str_2[2] = work_str[4];
		work_str_2[3] = work_str[5];

		if (type == 4 | type == 5) { // 128*64 OLED
			if (SW == 1) column = 6;
			else column = 4;
			led_wr_str(column, 16, "C=", 2);
			led_wr_str(column, 16 + 6 * 12, "pF", 2);
			led_wr_str(column, 16 + 2 * 12, work_str_2, 4);
		} else if (type == 2 | type == 3) {// 128*32 OLED
			if (SW == 1) column = 1;
			else column = 0;
			led_wr_str(column, 9, "C=", 2);
			led_wr_str(column, 15, "pF", 2);
			led_wr_str(column, 11, work_str_2, 4);
		} else if (type == 1) { // 1602 LCD
			if (SW == 1) column = 1;
			else column = 0;
			led_wr_str(column, 9, "C=", 2);
			led_wr_str(column, 15, "p", 1);
			led_wr_str(column, 11, work_str_2, 4);
		}
	}

	asm("CLRWDT");

	return;
}

void Test_init(void) { // Test mode
	if (type == 4 | type == 5) // 128*64 OLED
		led_wr_str(0, 10, "TEST MODE", 9);
	else if (type != 0) // 1602 LCD  or 128*32 OLED
		led_wr_str(0, 3, "TEST MODE", 9);
	asm("CLRWDT");
	Delay_ms(500);
	asm("CLRWDT");
	Delay_ms(500);
	asm("CLRWDT");
	Delay_ms(500);
	asm("CLRWDT");
	Delay_ms(500);
	asm("CLRWDT");
	if (type == 4 | type == 5) // 128*64 OLED
		led_wr_str(0, 10, "         ", 9);
	else if (type != 0) // 1602 LCD  or 128*32 OLED
		led_wr_str(0, 3, "         ", 9);
	atu_reset();
	SW = 1; // C to OUT
	set_sw(SW);
	EEPROM_Write(255, cap);
	EEPROM_Write(254, ind);
	EEPROM_Write(253, SW);
	//
	if (type == 4 | type == 5) // 128*64 OLED
		led_wr_str(0, 16 + 12 * 8, "l", 1);
	else if (type != 0) // 1602 LCD or 128*32 OLED
		led_wr_str(0, 8, "l", 1);
	//
	lcd_prep_short = 1;
	lcd_prep();
	return;
}

void cells_init(void) {
	asm("CLRWDT");

#if defined(READ_OLED_ADDR_FROM_EEPROM)
	oled_addr = EEPROM_Read(0);											// address
#endif
	type = EEPROM_Read(1);												// type of display
	if (EEPROM_Read(2) == 1) Auto = 1;
	Rel_Del = Bcd2Dec(EEPROM_Read(3));									// Relay's Delay
	Auto_delta = Bcd2Dec(EEPROM_Read(4)) * 10;							// Auto_delta
	min_for_start = Bcd2Dec(EEPROM_Read(5)) * 10;						// P_min_for_start
	max_for_start = Bcd2Dec(EEPROM_Read(6)) * 10;						// P_max_for_start
	// 7  - shift down
	// 8 - shift left
	max_swr = Bcd2Dec(EEPROM_Read(9)) * 10;								// Max SWR
	L_q = EEPROM_Read(10);
	L_linear = EEPROM_Read(11);
	C_q = EEPROM_Read(12);
	C_linear = EEPROM_Read(13);
	D_correction = EEPROM_Read(14);
	L_invert = EEPROM_Read(15);

	asm("CLRWDT");

	Ind1 = Bcd2Dec(EEPROM_Read(16)) * 100 + Bcd2Dec(EEPROM_Read(17));	// Ind1
	Ind2 = Bcd2Dec(EEPROM_Read(18)) * 100 + Bcd2Dec(EEPROM_Read(19));	// Ind2
	Ind3 = Bcd2Dec(EEPROM_Read(20)) * 100 + Bcd2Dec(EEPROM_Read(21));	// Ind3
	Ind4 = Bcd2Dec(EEPROM_Read(22)) * 100 + Bcd2Dec(EEPROM_Read(23));	// Ind4
	Ind5 = Bcd2Dec(EEPROM_Read(24)) * 100 + Bcd2Dec(EEPROM_Read(25));	// Ind5
	Ind6 = Bcd2Dec(EEPROM_Read(26)) * 100 + Bcd2Dec(EEPROM_Read(27));	// Ind6
	Ind7 = Bcd2Dec(EEPROM_Read(28)) * 100 + Bcd2Dec(EEPROM_Read(29));	// Ind7

	Cap1 = Bcd2Dec(EEPROM_Read(32)) * 100 + Bcd2Dec(EEPROM_Read(33));	// Cap1
	Cap2 = Bcd2Dec(EEPROM_Read(34)) * 100 + Bcd2Dec(EEPROM_Read(35));	// Cap2
	Cap3 = Bcd2Dec(EEPROM_Read(36)) * 100 + Bcd2Dec(EEPROM_Read(37));	// Cap3
	Cap4 = Bcd2Dec(EEPROM_Read(38)) * 100 + Bcd2Dec(EEPROM_Read(39));	// Cap4
	Cap5 = Bcd2Dec(EEPROM_Read(40)) * 100 + Bcd2Dec(EEPROM_Read(41));	// Cap5
	Cap6 = Bcd2Dec(EEPROM_Read(42)) * 100 + Bcd2Dec(EEPROM_Read(43));	// Cap6
	Cap7 = Bcd2Dec(EEPROM_Read(44)) * 100 + Bcd2Dec(EEPROM_Read(45));	// Cap7

	P_High = EEPROM_Read(0x30);											/* High power mode */
	K_Mult = Bcd2Dec(EEPROM_Read(0x31));								/* Tandem Match ratio */
	Dysp_delay = Bcd2Dec(EEPROM_Read(0x32));							/* Display ON delay */
	Loss_ind = EEPROM_Read(0x33);
	Fid_loss = Bcd2Dec(EEPROM_Read(0x34));
	Relay_off = Bcd2Dec(EEPROM_Read(0x35));

	asm("CLRWDT");

	return;
}

void show_loss(void) {
	IntToStr(Fid_loss, work_str);
	if (Fid_loss >= 10) {
		work_str_2[0] = work_str[4];
	} else {
		work_str_2[0] = '0';
	}

	work_str_2[1] = '.';
	work_str_2[2] = work_str[5];

	if ((type == 4) || (type == 5)) {			/* 128x64 OLED display */
		led_wr_str(4, 6, work_str_2, 3);
	} else if (type != 0) {						/* 16x2 LCD or 128x32 OLED display */
		led_wr_str(1, 0, work_str_2, 3);
	}

	return;
}
